Examinator/src/InformationRegisters/ВозможностиУчитьсяСУО/ВозможностиУчитьсяСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВозможностиУчитьсяСУО</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>МожетУчиться</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>Загружено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗагрузки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторСтроки</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Бессрочно</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/InformationRegisters/ВозможностиУчитьсяСУО/Forms/НастройкаВозможностиУчиться/Module.bsl
#Область ОбработчикиСобытийФормы

// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если НЕ ЗначениеЗаполнено(Параметры.Пользователь) Тогда
		ВызватьИсключение НСтр("ru = 'Параметр Пользователь не заполнен'");
	КонецЕсли;	
	Заголовок = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Возможности учиться: %1'"), Параметры.Пользователь);	
	ТекущийПользователь = Пользователи.ТекущийПользователь();
	ДатаПоследнейЗагрузки = РегистрыСведений.ВозможностиУчитьсяСУО.ДатаПоследнейЗагрузки(Параметры.Пользователь);
	ЗаполнитьТаблицу();
	ЗаполнитьСводнуюДиаграмму();	
	УстановитьДоступностьЭлементовФормы();	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыВозможностиУчиться

// ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЦЫ ФОРМЫ ВозможностиУчиться

&НаКлиенте
Процедура ВозможностиУчитьсяПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока ИЛИ Копирование Тогда
		Элементы.ВозможностиУчиться.ТекущиеДанные.ИдентификаторСтроки = Новый УникальныйИдентификатор();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВозможностиУчитьсяПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	Если ОтменаРедактирования Тогда
		Возврат;
	КонецЕсли;
	ПроверитьТаблицуВозможностиУчиться(Отказ);
КонецПроцедуры

&НаКлиенте
Процедура ВозможностиУчитьсяПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	Если ОтменаРедактирования Тогда
		Возврат;
	КонецЕсли;
	Элементы.ВозможностиУчиться.ТекущиеДанные.Ответственный = ТекущийПользователь;
	Элементы.ВозможностиУчиться.ТекущиеДанные.ДатаИзменения = ТекущаяДата();
	ЗаписатьВозможностиУчиться();
КонецПроцедуры

&НаКлиенте
Процедура ВозможностиУчитьсяПослеУдаления(Элемент)
	ЗаписатьВозможностиУчиться();
КонецПроцедуры

&НаКлиенте
Процедура ВозможностиУчитьсяДатаНачалаПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Элементы.ВозможностиУчиться.ТекущиеДанные.ДатаОкончания)
		И Элементы.ВозможностиУчиться.ТекущиеДанные.ДатаОкончания < Элементы.ВозможностиУчиться.ТекущиеДанные.ДатаНачала Тогда
		Элементы.ВозможностиУчиться.ТекущиеДанные.ДатаОкончания = Элементы.ВозможностиУчиться.ТекущиеДанные.ДатаНачала;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Общее

&НаСервере
Процедура УстановитьДоступностьЭлементовФормы()
	Элементы.ДатаПоследнейЗагрузки.Видимость = ЗначениеЗаполнено(ДатаПоследнейЗагрузки);
	Элементы.ДекорацияНетАвтоДанных.Видимость = НЕ ЗначениеЗаполнено(ДатаПоследнейЗагрузки);
КонецПроцедуры

// Сводная диаграмма Ганта

&НаСервере
Процедура ЗаполнитьСводнуюДиаграмму()
		
	ЭтотДень = НачалоДня(ТекущаяДатаСеанса());
	Если ЗначениеЗаполнено(Параметры.НачалоПериода) Тогда
		НачалоПериодаДиаграммы = НачалоМесяца(Параметры.НачалоПериода);
	Иначе
		НачалоПериодаДиаграммы = НачалоМесяца(ЭтотДень);
	КонецЕсли;
	Если ЗначениеЗаполнено(Параметры.КонецПериода) Тогда
		КонецПериодаДиаграммы = КонецМесяца(ДобавитьМесяц(Параметры.КонецПериода, 12));
	Иначе
		КонецПериодаДиаграммы = КонецМесяца(ДобавитьМесяц(ЭтотДень, 12));
	КонецЕсли;
	
	СводнаяДиаграмма.Очистить();
	
	СводнаяДиаграмма.ПоддержкаМасштаба = ПоддержкаМасштабаДиаграммыГанта.Авто;
	СводнаяДиаграмма.АвтоОпределениеПолногоИнтервала = Ложь;
	СводнаяДиаграмма.УстановитьПолныйИнтервал(НачалоПериодаДиаграммы, КонецПериодаДиаграммы);
	СводнаяДиаграмма.ОтображатьЛегенду = Ложь;
	СводнаяДиаграмма.ОтображатьЗаголовок = Ложь;
		
	// Добавляем серии

	Серия = СводнаяДиаграмма.УстановитьСерию("Не может учиться");
	
	// Создаем точку и значения
	
	НоваяТочка = СводнаяДиаграмма.УстановитьТочку(Параметры.Пользователь); 
	
	ВсеЗаписиЗаПериод = РегистрыСведений.ВозможностиУчитьсяСУО.ВсеЗаписиЗаПериод(Параметры.Пользователь, НачалоПериодаДиаграммы, КонецПериодаДиаграммы);
	ВсеБессрочныеЗаписи = ВсеЗаписиЗаПериод.НайтиСтроки(Новый Структура("Бессрочно", Истина));	
	
	ТекущийДень = НачалоПериодаДиаграммы;
	Пока ТекущийДень <= КонецПериодаДиаграммы Цикл
		
		МожетУчитьсяВТекущийДень = Истина;
		ОписаниеВТекущийДень = "";
		
		// Ищем бессрочный период до даты
		
		Если ВсеБессрочныеЗаписи.Количество() > 0 Тогда
			
			БлижайшийБессрочныйПериодКДате = Неопределено;
			Для каждого СтрокаБЗ Из ВсеБессрочныеЗаписи Цикл
				Если СтрокаБЗ.Период > ТекущийДень Тогда
					Продолжить; // Не учитываем все, что позже анализируемого дня
				КонецЕсли;
				Если БлижайшийБессрочныйПериодКДате = Неопределено
					ИЛИ СтрокаБЗ.Период > БлижайшийБессрочныйПериодКДате.Период Тогда
					БлижайшийБессрочныйПериодКДате = СтрокаБЗ;
				КонецЕсли;
			КонецЦикла;
			
			Если БлижайшийБессрочныйПериодКДате <> Неопределено Тогда
				МожетУчитьсяВТекущийДень = БлижайшийБессрочныйПериодКДате.МожетУчиться;
				ОписаниеВТекущийДень = БлижайшийБессрочныйПериодКДате.Описание;										
			КонецЕсли;
			
		КонецЕсли;		
		
		// Ищем запись о невозможности учиться на дату
		
		СтрокиНеМожетУчитьсяНаДату = ВсеЗаписиЗаПериод.НайтиСтроки(Новый Структура("Период, Бессрочно", ТекущийДень, Ложь));
		
		Если СтрокиНеМожетУчитьсяНаДату.Количество() > 0 Тогда
			МожетУчитьсяВТекущийДень = СтрокиНеМожетУчитьсяНаДату[0].МожетУчиться;
			ОписаниеВТекущийДень = СтрокиНеМожетУчитьсяНаДату[0].Описание;						
		КонецЕсли;
		
		// Добавляем значение диаграммы
		
		Если НЕ МожетУчитьсяВТекущийДень Тогда
			ЗначениеДиаграммы = СводнаяДиаграмма.ПолучитьЗначение(НоваяТочка, Серия);
			Интервал = ЗначениеДиаграммы.Добавить();
			Интервал.Начало = НачалоДня(ТекущийДень);
			Интервал.Конец = КонецДня(ТекущийДень) + 1;
			Интервал.Текст = ОписаниеВТекущийДень;
		КонецЕсли;
		
		// Переходим к следующему дню
		
		ТекущийДень = КонецДня(ТекущийДень) + 1;		
		
	КонецЦикла;
		
	СводнаяДиаграмма.РазвернутьТочку(НоваяТочка, Истина);
	
КонецПроцедуры

// Таблица ВозможностиУчиться

&НаСервере
Процедура ЗаполнитьТаблицу()
	
	ВозможностиУчиться.Очистить();
	
	ВсеРучныеЗаписи = РегистрыСведений.ВозможностиУчитьсяСУО.ВсеРучныеЗаписи(Параметры.Пользователь);
	
	ВсеИдентификаторыСтрок = ВсеРучныеЗаписи.ВыгрузитьКолонку("ИдентификаторСтроки");
	ВсеИдентификаторыСтрок = ОбщегоНазначенияКлиентСервер.СвернутьМассив(ВсеИдентификаторыСтрок);
	
	Для каждого ИдентификаторСтроки Из ВсеИдентификаторыСтрок Цикл
		
		Если НЕ ЗначениеЗаполнено(ИдентификаторСтроки) Тогда
			Продолжить;
		КонецЕсли;
		
		ЗаписиСтроки = ВсеРучныеЗаписи.НайтиСтроки(Новый Структура("ИдентификаторСтроки", ИдентификаторСтроки));
		
		ДатаНачалаСтроки = Неопределено;
		ДатаОкончанияСтроки = Неопределено;
		Описание = Неопределено;
		МожетУчиться = Неопределено;
		Ответственный = Неопределено;
		ДатаИзменения = Неопределено;		
		
		Если ЗаписиСтроки.Количество() = 1 И ЗаписиСтроки[0].Бессрочно Тогда 
			
			ДатаНачалаСтроки = ЗаписиСтроки[0].Период;
			ДатаОкончанияСтроки = Неопределено;
			Описание = ЗаписиСтроки[0].Описание;
			МожетУчиться = ЗаписиСтроки[0].МожетУчиться;
			Ответственный = ЗаписиСтроки[0].Ответственный;
			ДатаИзменения = ЗаписиСтроки[0].ДатаИзменения;			
			
		Иначе
			
			Для каждого ЗаписьСтроки Из ЗаписиСтроки Цикл
			
				Если ДатаНачалаСтроки = Неопределено
					ИЛИ ЗаписьСтроки.Период < ДатаНачалаСтроки Тогда				
					ДатаНачалаСтроки = ЗаписьСтроки.Период;				
				КонецЕсли;	
				
				Если ДатаОкончанияСтроки = Неопределено
					ИЛИ ЗаписьСтроки.Период > ДатаОкончанияСтроки Тогда				
					ДатаОкончанияСтроки = ЗаписьСтроки.Период;				
				КонецЕсли;	
				
				Если Описание = Неопределено Тогда
					Описание = ЗаписьСтроки.Описание;
				КонецЕсли;
				
				Если МожетУчиться = Неопределено Тогда
					МожетУчиться = ЗаписьСтроки.МожетУчиться;
				КонецЕсли;
				
				Если Ответственный = Неопределено Тогда
					Ответственный = ЗаписьСтроки.Ответственный;
				КонецЕсли;

				Если ДатаИзменения = Неопределено Тогда
					ДатаИзменения = ЗаписьСтроки.ДатаИзменения;
				КонецЕсли;			
				
			КонецЦикла;
			
		КонецЕсли;
			
		НоваяСтрокаТВУ = ВозможностиУчиться.Добавить();
		НоваяСтрокаТВУ.ДатаНачала = ДатаНачалаСтроки;
		НоваяСтрокаТВУ.ДатаОкончания = ДатаОкончанияСтроки;
		НоваяСтрокаТВУ.МожетУчиться = МожетУчиться;
		НоваяСтрокаТВУ.Описание = Описание;
		НоваяСтрокаТВУ.ИдентификаторСтроки = ИдентификаторСтроки;
		НоваяСтрокаТВУ.Ответственный = Ответственный;
		НоваяСтрокаТВУ.ДатаИзменения = ДатаИзменения;
		
	КонецЦикла;

	ВозможностиУчиться.Сортировать("ДатаНачала");
	
КонецПроцедуры

&НаСервере
Функция ДатаВСтроку(ДатаДляКонвертации)
	Возврат Формат(ДатаДляКонвертации, "ДЛФ=D; ДП=Бессрочно")
КонецФункции

&НаКлиенте
Процедура ПроверитьТаблицуВозможностиУчиться(Отказ)
	
	ЭтотДень = НачалоДня(ТекущаяДата());
	
	Для каждого ПроверяемыйПериод1 Из ВозможностиУчиться Цикл
		
		Если НЕ ЗначениеЗаполнено(ПроверяемыйПериод1.ДатаНачала) Тогда			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Дата начала не заполнена'"));				
			Отказ = Истина;
			Возврат;						
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ПроверяемыйПериод1.ДатаОкончания)
			И ПроверяемыйПериод1.ДатаНачала > ПроверяемыйПериод1.ДатаОкончания Тогда
			
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'В периоде %1 - %2 дата начала больше даты окончания'"),
				ДатаВСтроку(ПроверяемыйПериод1.ДатаНачала),
				ДатаВСтроку(ПроверяемыйПериод1.ДатаОкончания));
				
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);				
			Отказ = Истина;
			Возврат;
			
		КонецЕсли;
		
		// Проверяем не пересекаются ли периоды
		
		Для каждого ПроверяемыйПериод2 Из ВозможностиУчиться Цикл
			
			Если ПроверяемыйПериод1.ИдентификаторСтроки = ПроверяемыйПериод2.ИдентификаторСтроки Тогда
				Продолжить;
			КонецЕсли;
			
			Если ПериодыПересекаются(
				ПроверяемыйПериод1.ДатаНачала,
				ПроверяемыйПериод1.ДатаОкончания,
				ПроверяемыйПериод2.ДатаНачала,
				ПроверяемыйПериод2.ДатаОкончания) Тогда
				
				ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'Периоды %1 - %2  и %3 - %4 пересекаются'"),
					ДатаВСтроку(ПроверяемыйПериод1.ДатаНачала),
					ДатаВСтроку(ПроверяемыйПериод1.ДатаОкончания),
					ДатаВСтроку(ПроверяемыйПериод2.ДатаНачала),
					ДатаВСтроку(ПроверяемыйПериод2.ДатаОкончания));
				
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);				
				Отказ = Истина;
				Возврат;
				
			КонецЕсли;
			
			
		КонецЦикла;		
			
	КонецЦикла;
	
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьВозможностиУчиться()
	
	ЭтотДень = НачалоДня(ТекущаяДатаСеанса());	
	
	// Записываем данные в БД
		
	НачатьТранзакцию();
	
	Попытка
		
		// Приводим все записи в БД к авто варианту		
		
		ВсеРучныеЗаписи = РегистрыСведений.ВозможностиУчитьсяСУО.ВсеРучныеЗаписи(Параметры.Пользователь);

		Для каждого СтрокаТБД Из ВсеРучныеЗаписи Цикл
			РегистрыСведений.ВозможностиУчитьсяСУО.УдалитьРучноеЗначение(СтрокаТБД.Пользователь, СтрокаТБД.Период, СтрокаТБД.Бессрочно);
		КонецЦикла;		
		
		// Записываем новые записи в БД
		
		Для каждого СтрокаВУ Из ВозможностиУчиться Цикл
			Если ЗначениеЗаполнено(СтрокаВУ.ДатаОкончания) Тогда
				ТекущийПериод = СтрокаВУ.ДатаНачала;
				Пока ТекущийПериод <= СтрокаВУ.ДатаОкончания Цикл
					РегистрыСведений.ВозможностиУчитьсяСУО.УстановитьРучноеЗначение(
						Параметры.Пользователь, ТекущийПериод, Ложь, СтрокаВУ.МожетУчиться,
						СтрокаВУ.ИдентификаторСтроки, СтрокаВУ.Ответственный, СтрокаВУ.ДатаИзменения, СтрокаВУ.Описание);
					ТекущийПериод = КонецДня(ТекущийПериод) + 1;						
				КонецЦикла;					
			Иначе
				РегистрыСведений.ВозможностиУчитьсяСУО.УстановитьРучноеЗначение(
					Параметры.Пользователь, СтрокаВУ.ДатаНачала, Истина, СтрокаВУ.МожетУчиться,
					СтрокаВУ.ИдентификаторСтроки, СтрокаВУ.Ответственный, СтрокаВУ.ДатаИзменения, СтрокаВУ.Описание);
			КонецЕсли;
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
	
	Исключение
	
	 	ОтменитьТранзакцию();
		ВызватьИсключение;
		
	КонецПопытки;
	
	ЗаполнитьСводнуюДиаграмму();
	
КонецПроцедуры

&НаСервере
Функция ПериодыПересекаются(Знач НачалоПериода1, Знач КонецПериода1, Знач НачалоПериода2, Знач КонецПериода2)
	
	Если НЕ ЗначениеЗаполнено(КонецПериода1) Тогда
		КонецПериода1 = Дата("99991231")
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(КонецПериода2) Тогда
		КонецПериода2 = Дата("99991231")
	КонецЕсли;	
	
	МаксимумНачал = Макс(НачалоПериода1, НачалоПериода2);
	МинимумКонцов = Мин(КонецПериода1, КонецПериода2);
	
	Если МаксимумНачал <= МинимумКонцов Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
	
КонецФункции


#КонецОбласти
